# Задача.стр.30.Множ-4
# Даны три следующих множества:
# X = {"A", "P", "I", "B", "E, "H", "C", "G", "O", "R", "K", "N"}
# Y = {"A", "J", "S", "P", "I", "L", "D", "C", "G", "Q", "F", "N"}
# Z = {"A", "J", "N", "B", "U", "T", "H", "D", "G", "Q", "O", "M"}

# Попробуйте подобрать формулу для:
# {"C", "I", "P", "A", "G", "N", "B", "H", "O", "D", 'Q', "J"}

from rich import print


X = {"A", "P", "I", "B", "E", "H", "C", "G", "O", "R", "K", "N"}
Y = {"A", "J", "S", "P", "I", "L", "D", "C", "G", "Q", "F", "N"}
Z = {"A", "J", "N", "B", "U", "T", "H", "D", "G", "Q", "O", "M"}

# Необходимо подобрать формулу, чтобы из трех множест 'X', 'Y' и 'Z' получить 'R'
R = {"C", "I", "P", "A", "G", "N", "B", "H", "O", "D", 'Q', "J"}

# Решение сводится к таким операциям как:

# 1.Пересечение множеств, записывается следующим образом:
# set.intersection(other_set) или set & other_set

# 2.Объединение множеств, записывается следующим образом:
# set.union(other_set) или set | other_set

# Решение
print(sorted(list(R)))
A = X.intersection(Y).union(Y.intersection(Z), Z.intersection(X))
print(sorted(list(A)))

# Если решение равно 'R', программа напечатает 'True'
print(A == R)
