# Задача№2.стр.29.
# Напишите функцию:
# def convert(n, m, s)
# s - число, которое нужно преобразовать.
# n - из какой системы счисления нужно преобразовать.
# m - в какую систему счисления нужно преобразовать.

from rich import print


dict_ = {0: "0", 1: "1", 2: "2", 3: "3", 4: "4", 5: "5", 6: "6", 7: "7", 8: "8",
         9: "9", 10: "a", 11: "b", 12: "c", 13: "d", 14: "e", 15: "f", 16: "g"}

def convert(n, m, s):
    '''Функция переводит число 's' из 'n' в 'm' систему счисления'''
    s10 = int(s, n)
    # print("s10=", s10) # s10= 91
    if m == 10:
        return s10
    l = [s10]
    # print("l=", l) # l= [91]
    i = 0
    while l[i] > (m-1):
        a = l[i] % m
        # print("a=", a) # a= 11
        b = (l[i] - a) // m
        # print("b=", b) # b= 5
        l.append(b)
        l[i] = a
        i += 1
    s2 = ""
    # сопоставляет число из списка l с индексом j словарю, затем полученное число (type str) приклеивает к строке s2
    for j in range(len(l)-1, 0-1, -1):
        # print(j)
        s2 += dict_[l[j]]
    return s2


# run
n = 10
m = 16
s = "91"

print(convert(n, m, s)) # OUT: 5b
