# Задание N3_Барсуков

def nfib(n):
    """Функция-генератор чисел Фибоначчи. Принимает в качестве аргумента
    n - максимальное количество чисел Фибоначчи"""
    fst_num, snd_num = 1, 1
    for i in range(n):
        yield fst_num
        fst_num, snd_num = snd_num, fst_num + snd_num


####################
## Функция list() ##
####################

list_ = list(nfib(20))
print(list_)


########################
## List comprehension ##
########################

gen_list_ = [i for i in nfib(20)]
print(gen_list_)


##############
## Цикл for ##
##############

for_list_ = []
for i in nfib(20):
    for_list_.append(i)
print(for_list_)


#########################
## Генератор множества ##
#########################

gen_set_ = {i for i in nfib(20)}
print(gen_set_) # в этом случае len(gen_set_) == 19


#######################################
## Генератор множества дополнительно ##
#######################################

# Поскольку по условию задачи требуется
# •   создание множества из 20 чисел Фибоначчи с помощью генератора множества
# и множества исключают дубли, то в качестве дополнительного решения:

gen_set_plus = {i for i in nfib(21)}
print(gen_set_plus) # в этом случае len(gen_set_plus) == 20
